# WireSizeSet Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
WireSizeSet Class
Members See Also
---
A set that contains wire sizes.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class WireSizeSet : APIObject,
	IEnumerable
```

Visual Basic
---
```text
Public Class WireSizeSet _
	Inherits APIObject _
	Implements IEnumerable
```

Visual C++
---
```text
public ref class WireSizeSet : public APIObject,
	IEnumerable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..APIObject Autodesk.Revit.DB.Electrical..::..WireSizeSet
# See Also
WireSizeSet Members
Autodesk.Revit.DB.Electrical Namespace